package lesson01.part1;

public class Task03 {

    /**
     * Задание:
     * Написать программу, выводящую на экран год основания МТУСИ.
     *
     * Требования:
     * 1. Программа должна выводить текст.
     * 2. Выведенный год должен состоять из 4 цифр.
     * 3. Выведенный год должен начинаться с "19".
     * 4. Выведенный год должен соответствовать заданию.
     */

    public static void main(String[] args) {
        System.out.println("МТУСИ основан в " + (2019-98) + " году.");
    }
}
